Revit 2027 API
RebarShape.StirrupTieAttachment Property
 The attachment type of stirrup ties and rebars.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StirrupTieAttachmentType StirrupTieAttachment { get; }
Public ReadOnly Property StirrupTieAttachment As StirrupTieAttachmentType
	Get
public:
property StirrupTieAttachmentType StirrupTieAttachment {
	StirrupTieAttachmentType get ();
}
member StirrupTieAttachment : StirrupTieAttachmentType with get
Property Value
StirrupTieAttachmentType
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace